CSI API ETABS v1

# cDesignSteelBS5950_2000 Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDStBS5950_2000 BS5950_2000 { get; }

    ReadOnly Property BS5950_2000 As cDStBS5950_2000
    	Get

    Dim instance As cDesignSteel
    Dim value As cDStBS5950_2000

    value = instance.BS5950_2000

    property cDStBS5950_2000^ BS5950_2000 {
    	cDStBS5950_2000^ get ();
    }

    abstract BS5950_2000 : cDStBS5950_2000 with get

#### Property Value

Type: cDStBS5950_2000

See Also

#### Reference

cDesignSteel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com